"cheqiyu" = "rose at the swordfish, native to South America Amazon River, Guyana, fish into fusiform, wide, flat, up to 5 cm long, rose like a weak acid at the sailfish soft water, can also adapt to the neutral and slightly alkaline water";
"denglongyu" = "lantern fish, fish head and tail lights, also known as lantern fish lantern fish, fish lamp etc.. Located in the Guyana of South America and the Amazon basin. Body length 4 ~ 5 cm. Long and short head, flat, round belly. Both the upper and the tail of each have a piece of golden brown spot, in the light irradiation, the reflection of the golden yellow and red color";
"dianmanyu" = "gymnotidae eel, eel shaped South American fish can produce enough to stun a human, is the strongest discharge of freshwater fish, the output voltage up to 300 ~ 800 volt high-voltage lines in the water so that the eel";
"dinianyu" = "mouth catfish, generally only two beard, small size, high requirements on water quality, it is difficult to breed";
"fangyu" = "tilefish, body length of 400 mm, body extended, flat, blunt head, near the square, big eyes, a high, head and chest, upper torso circular scales, other parts are ctenoid, high side and body parallel to the edge of the back";
"haigui" = "turtle Chelonia chelonidae animalWidely distributed in the Atlantic, Pacific Ocean and India ocean. China Sea Turtle from Shandong, South to the northern Gulf Coast are distributed. Up to more than 1 meters long, life is about 150 years old";
"hetun" = "puffer, commonly known as fish , referred to as the bony fish tetraodontidae. Puffer body is cylindrical, with an air of danger, will inhale expansion, body length of 25 cm - 35";
"jianyu" = " also known as swordfish swordfish. Is the world's tropical and Subtropical Ocean in a common fish, due to its upper jaw forward extension was named after the sword, moving speed up to 130 kilometers per hour";
"jinqiangyu" = "tuna, body long, thick and round, is a streamlined, tapered tip and backward tail slender, forked or crescent shaped caudal fin. The tail handle on both sides of a ridged obvious, dorsal and ventral fin behind each line finlet. With torpedo shape, the cross section is slightly circular ";
"shayu" = "sharks, live in the ocean, is the most ferocious fish in the ocean, the skeleton of the shark is composed of cartilage, rather than by the bones. Cartilage is lighter and more flexible than bone ";
"shiziyu" = "lion fish, most are small, about 30 centimeters (12 inches) long. Body long, soft, tadpole shape, skin relaxation, no scales, and sometimes spinulate. The dorsal fin long, pelvic fins in the head, forming a sucker, used to absorb the sea. Distribution in the North Atlantic, North Pacific and the north and south polar cold water area";
"tianshiyu" = "angelfish, dorsal and anal fins are very long and large, upright as the jib, so there is a fish called finlet. Look at the fairy fish swimming from the side, as the swallows fly, so also known as platax TEIRA angelfish";
"xiaochouyu" = "clown fish, is commonly known as damselfish subfamily of fish fish Kwai Kehai, because his face has one or two white stripes, like Peking Opera clown named, is a tropical saltwater fish. Clownfish and anemones have a symbiotic relationship inseparable, also known as sea anemone fish";
"xiaohuangyu" = "small yellow croaker, also known as small yellow croaker, vertebrate, Osteichthyes, Mullidae, also known as: small, fresh color, big eyes, small cucumber, ancient fish, yellow, small spring, Linyu Jinlong, thick scale Aberdeen, also called the yellow and small yellow flowers";
"xiaolvyu" = "little green fish, a green fish";
